<a href="https://colab.research.google.com/github/AlexFerreira10/introducao-ciencia-dados-fat-uerj/blob/main/Revis%C3%A3o%20de%20Python/Pandas/Series.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Series

É muito parecido com o Array do Numpy. Porém pode aceitar "qualquer tipo de dados" e ser indexado também por rôtulos.

## Criando um Series

- Podemos converter uma lista, matriz, dicionário em um Serie

In [43]:
import numpy as np
import pandas as pd

In [44]:
labels = ['a', 'b', 'c']
lista = [10, 20, 30]
arrays = np.array([10, 20, 30])
d = {'a': 10, 'b': 20, 'c': 30}

In [45]:
# Convertendo list em Serie
pd.Series(data = lista)

0    10
1    20
2    30
dtype: int64

In [46]:
# Adionando Rôtulos
pd.Series(data = lista, index = labels)

a    10
b    20
c    30
dtype: int64

In [47]:
# Transformando Array do Numpy em Serie
pd.Series(data = arrays, index = labels)

a    10
b    20
c    30
dtype: int64

In [48]:
# Convertenado dicionário em Serie
pd.Series(data = d)

a    10
b    20
c    30
dtype: int64

## Dados de um Series

- Pode ter vários objetos
- Pode ter funções

In [23]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

## Usando índice

- São usados como elementos de busca
- Parecidos como uma tabela de hash ou dicionario

In [40]:
ser1 = pd.Series(data = [1 , 2, 3], index = ["A", "B", "C"])
ser2 = pd.Series(data = [4 , 5, 6], index = ["A", "B", "C"])

In [31]:
ser1["A"]

1

In [42]:
# Operações também podem ser feitas
# Da problema se forem de tipos diferentes
ser1 + ser2

A    5
B    7
C    9
dtype: int64